000001 IDENTIFICATION DIVISION.
000002     PROGRAM-ID. IMC.
000003     AUTHOR. Alexandre S S Alves.
000004
000005 ENVIRONMENT DIVISION.
000006
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION.
000009
000010 01 ALTURA    PIC 9V99.
000011 01 PESO      PIC 999.
000012 01 IMC_TOTAL PIC ZZ9.99.
000013    
000014    
000015    
000016 PROCEDURE DIVISION.
000017  PRINCIPAL.
000018     DISPLAY "Entre com sua Altura (em Metros): ".
000019     ACCEPT ALTURA.
000020     DISPLAY "Entre com seu Peso (em KG): ".
000021     ACCEPT PESO.
000022     
000023     COMPUTE IMC_TOTAL = PESO / (ALTURA ** 2).
000024     DISPLAY "Seu IMC e " IMC_TOTAL.
000025     
000026
000025 STOP RUN.
000026 END PROGRAM IMC.
